constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}


dynamicFvMesh   solidBodyMotionFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

solidBodyMotionFvMeshCoeffs
{
    cellZone        AMIsurface;

    solidBodyMotionFunction  rotatingMotion;
    rotatingMotionCoeffs
    {
	origin		(0 0 0);
	axis		(0 0 1);
        omega		table
	(
            (0.0 3.60626845303)
            (0.015037593985 3.55186613811)
            (0.0300751879699 3.50473807964)
            (0.0451127819549 3.46626587698)
            (0.0601503759398 3.43757737566)
            (0.0751879699248 3.41951360365)
            (0.0902255639098 3.41260411587)
            (0.105263157895 3.41705146988)
            (0.12030075188 3.43272528768)
            (0.135338345865 3.45916607789)
            (0.15037593985 3.49559870613)
            (0.165413533835 3.54095511873)
            (0.18045112782 3.59390565366)
            (0.195488721805 3.65289802067)
            (0.210526315789 3.71620280806)
            (0.225563909774 3.78196418183)
            (0.240601503759 3.84825429103)
            (0.255639097744 3.91312978441)
            (0.270676691729 3.97468878137)
            (0.285714285714 4.03112662725)
            (0.300751879699 4.08078879831)
            (0.315789473684 4.12221940552)
            (0.330827067669 4.15420387518)
            (0.345864661654 4.17580455519)
            (0.360902255639 4.18638820315)
            (0.375939849624 4.18564455036)
            (0.390977443609 4.17359539764)
            (0.406015037594 4.1505939762)
            (0.421052631579 4.1173145924)
            (0.436090225564 4.07473285985)
            (0.451127819549 4.02409709845)
            (0.466165413534 3.96689173889)
            (0.481203007519 3.90479380522)
            (0.496240601504 3.83962375149)
            (0.511278195489 3.77329209359)
            (0.526315789474 3.70774340081)
            (0.541353383459 3.64489928917)
            (0.556390977444 3.58660208757)
            (0.571428571429 3.53456082834)
            (0.586466165414 3.49030114552)
            (0.601503759398 3.45512054959)
            (0.616541353383 3.43005038981)
            (0.631578947368 3.41582561936)
            (0.646616541353 3.41286324957)
            (0.661654135338 3.42125012483)
            (0.676691729323 3.44074037672)
            (0.691729323308 3.47076263183)
            (0.706766917293 3.51043676207)
            (0.721804511278 3.55859968637)
            (0.736842105263 3.6138394674)
            (0.751879699248 3.6745367037)
            (0.766917293233 3.73891200388)
            (0.781954887218 3.80507815093)
            (0.796992481203 3.87109542764)
            (0.812030075188 3.93502848106)
            (0.827067669173 3.99500305904)
            (0.842105263158 4.0492609555)
            (0.857142857143 4.0962115538)
            (0.872180451128 4.13447845697)
            (0.887218045113 4.16293983802)
            (0.902255639098 4.18076132719)
            (0.917293233083 4.1874204723)
            (0.932330827068 4.18272205481)
            (0.947368421053 4.16680381283)
            (0.962406015038 4.14013240327)
            (0.977443609023 4.1034897213)
            (0.992481203008 4.0579499785)
            (1.00751879699 4.00484821139)
            (1.02255639098 3.9457411437)
            (1.03759398496 3.8823615497)
            (1.05263157895 3.8165674564)
            (1.06766917293 3.75028767394)
            (1.08270676692 3.68546525086)
            (1.0977443609 3.62400051193)
            (1.11278195489 3.56769534858)
            (1.12781954887 3.51820039483)
            (1.14285714286 3.4769666376)
            (1.15789473684 3.44520287976)
            (1.17293233083 3.42384030305)
            (1.18796992481 3.41350516968)
            (1.2030075188 3.41450046293)
            (1.21804511278 3.42679700493)
            (1.23308270677 3.45003431202)
            (1.24812030075 3.48353116266)
            (1.26315789474 3.52630556803)
            (1.27819548872 3.57710355984)
            (1.29323308271 3.63443595148)
            (1.30827067669 3.69662199486)
            (1.32330827068 3.7618386529)
            (1.33834586466 3.82817404349)
            (1.35338345865 3.89368348788)
            (1.36842105263 3.95644652067)
            (1.38345864662 4.01462318987)
            (1.3984962406 4.06650799663)
            (1.41353383459 4.11057989346)
            (1.42857142857 4.14554687499)
            (1.44360902256 4.17038385425)
            (1.45864661654 4.18436271394)
            (1.47368421053 4.18707365182)
...
            );
        }
    }